Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::v1::PreferenceTableContainerBase Class Reference
MEP Element Manager
The PreferenceTableContainerBase contains PreferenceTables, and you can Add/Get/Delete them. More...
#include <MEPPreferenceTableContainerBase.hpp>
 Inheritance diagram for ACAPI::MEP::v1::PreferenceTableContainerBase:
 Public Member Functions
bool  | Exists () const
std::vector< UniqueID >  | GetPreferenceTables () const
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
Result< UniqueID >  | AddNewTable (GS::UniString tableName, const std::optional< API_Guid > &requiredId=std::nullopt)
Inserts a new PreferenceTable into the container.
Result< void >  | Delete (const UniqueID &uniqueId)
Deletes a PreferenceTable from the container.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions
PreferenceTableContainerBase (std::shared_ptr< Impl::IPreferenceTableContainerBaseImpl > impl)
Constructs a PreferenceTableContainerBase with the given base implementation.
Modifier (PreferenceTableContainerBase &parent)
Constructs a Modifier with the given PreferenceTableContainerBase.
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The PreferenceTableContainerBase contains PreferenceTables, and you can Add/Get/Delete them.
Since
Archicad 27
The containers for the three MEP domains are already initialized and you can get them from DuctPreferenceTableContainer, PipePreferenceTableContainer and CableCarrierPreferenceContainer
Example code snippet from Test / New MEP
Getters
 // Segment
 ACAPI::Result<DuctSegmentPreferenceTableContainer> ductSegmentContainer = GetDuctSegmentPreferenceTableContainer ();
 if (ductSegmentContainer.IsErr ())
 return ductSegmentContainer.UnwrapErr ().kind;
 std::vector<UniqueID> ductSegmentTableIds = ductSegmentContainer->GetPreferenceTables ();
 preferenceReporter.SetTabCount (1);
 preferenceReporter.Add ("Segment Preference Tables");
 for (UniqueID ductSegmentTableId : ductSegmentTableIds) {
 ACAPI::Result<DuctRectangularSegmentPreferenceTable> ductRectangularSegmentTable = DuctRectangularSegmentPreferenceTable::Get (ductSegmentTableId);
 if (ductRectangularSegmentTable.IsErr ())
 continue;
 preferenceReporter.SetTabCount (2);
 preferenceReporter.Add ("Preference name", ductRectangularSegmentTable->GetName ());
 preferenceReporter.Add ("Rectangular table:");
 for (uint32_t i = 0; i < ductRectangularSegmentTable->GetSize (); ++i) {
 preferenceReporter.SetTabCount (3);
 preferenceReporter.Add ("Value", *ductRectangularSegmentTable->GetValue (i), false);
 preferenceReporter.SetTabCount (0);
 preferenceReporter.Add (", ", false);
 GS::UniString description = *ductRectangularSegmentTable->GetDescription (i);
 preferenceReporter.Add ("Description", description == GS::EmptyUniString ? "Empty" : description);
 }
 preferenceReporter.AddNewLine ();
 ACAPI::Result<DuctCircularSegmentPreferenceTable> ductCircularSegmentTable = DuctCircularSegmentPreferenceTable::Get (ductSegmentTableId);
 if (ductCircularSegmentTable.IsErr ())
 continue;
 preferenceReporter.SetTabCount (2);
 preferenceReporter.Add ("Circular table:");
 for (uint32_t i = 0; i < ductCircularSegmentTable->GetSize (); ++i) {
 preferenceReporter.SetTabCount (3);
 preferenceReporter.Add ("ReferenceId", *ductCircularSegmentTable->GetReferenceId (i), false);
 preferenceReporter.SetTabCount (0);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Diameter", *ductCircularSegmentTable->GetDiameter (i), false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add ("Wall Thickness", *ductCircularSegmentTable->GetWallThickness (i), false);
 preferenceReporter.Add (", ", false);
 GS::UniString description = *ductCircularSegmentTable->GetDescription (i);
 preferenceReporter.Add ("Description", description == GS::EmptyUniString ? "Empty" : description, false);
 preferenceReporter.Add (", ", false);
 preferenceReporter.Add (*ductCircularSegmentTable->IsRowValid (i) ? "Row is valid" : "Row is not valid");
 }
 preferenceReporter.AddNewLine ();
 }
 preferenceReporter.Write ();
 Modification
 Reporter preferenceReporter;
 ACAPI::Result<DuctSegmentPreferenceTableContainer> container = GetDuctSegmentPreferenceTableContainer ();
 if (container.IsErr ())
 return container.UnwrapErr ().kind;
 preferenceReporter.Add ("Adding a new table to the duct container...");
 ACAPI::Result<void> modifyResult = container->Modify ([&](PreferenceTableContainerBase::Modifier& modifier) -> GSErrCode {
 ACAPI::Result<UniqueID> tableId = modifier.AddNewTable ("Duct sizes - added from MEP_Test");
 if (tableId.IsErr ())
 return tableId.UnwrapErr ().kind;
 return NoError;
 }, "Modify the content of duct container.");
 if (modifyResult.IsErr ())
 return modifyResult.UnwrapErr ().kind;
 preferenceReporter.Add ("New table successfully added.");
 preferenceReporter.AddNewLine ();
 std::vector<UniqueID> tableIds = container->GetPreferenceTables ();
 preferenceReporter.Add ("Deleting the first row of every shape of every duct table.");
 for (UniqueID uniqueId : tableIds) {
 ACAPI::Result<DuctRectangularSegmentPreferenceTable> rectangularTable = DuctRectangularSegmentPreferenceTable::Get (uniqueId);
 if (rectangularTable.IsErr ())
 continue;
 preferenceReporter.Add ("Trying to delete from", rectangularTable->GetName ());
 rectangularTable->Modify ([&](DuctRectangularSegmentPreferenceTable::Modifier& modifier) {
 preferenceReporter.SetTabCount (1);
 ACAPI::Result<void> rDeleteResult = modifier.Delete (0);
 if (rDeleteResult.IsOk ())
 preferenceReporter.Add ("Deletion of the first element from rectangular sizes was successful.");
 else
 preferenceReporter.Add ("Deletion unsuccessful", GS::UniString (rDeleteResult.UnwrapErr ().text));
 }, "Delete from rectangular preference table.");
 ACAPI::Result<DuctCircularSegmentPreferenceTable> circularTable = DuctCircularSegmentPreferenceTable::Get (uniqueId);
 if (circularTable.IsErr ())
 continue;
 uint32_t firstValidRowIndex = 0;
 for (uint32_t i = 0; i < circularTable->GetSize (); ++i) {
 if (*circularTable->IsRowValid (i)) {
 firstValidRowIndex = i;
 break;
 }
 }
 preferenceReporter.Add ("Trying to empty the first valid row of", circularTable->GetName ());
 circularTable->Modify ([&](DuctCircularSegmentPreferenceTable::Modifier& modifier) {
 preferenceReporter.SetTabCount (1);
 ACAPI::Result<void> cDeleteResult = modifier.EmptyRow (firstValidRowIndex);
 if (cDeleteResult.IsOk ())
 preferenceReporter.Add ("Deletion of the first element from circular sizes was successful.");
 else
 preferenceReporter.Add ("Deletion unsuccessful", GS::UniString (cDeleteResult.UnwrapErr ().text));
 }, "Delete from circular preference table.");
 preferenceReporter.SetTabCount (0);
 }
 preferenceReporter.Write ();
Constructor & Destructor Documentation
◆ PreferenceTableContainerBase()
 ACAPI::MEP::v1::PreferenceTableContainerBase::PreferenceTableContainerBase  |  ( |  std::shared_ptr< Impl::IPreferenceTableContainerBaseImpl >  |  impl | )
protected
Constructs a PreferenceTableContainerBase with the given base implementation.
Parameters
impl | The given base implementation.
Member Function Documentation
◆ AddNewTable()
 Result< UniqueID > ACAPI::MEP::v1::PreferenceTableContainerBase::AddNewTable  |  ( |  GS::UniString  |  tableName,
|  const std::optional< API_Guid > &  |  requiredId = std::nullopt
)
Inserts a new PreferenceTable into the container.
Parameters
tableName | The name of the table. It will be trimmed of leading and trailing whitespaces. This must be a non-empty and currently non-existent name in the container.
requiredId | The guid to be set for the PreferenceTable - optional parameter
Returns
In case of successful insertion, returns the UniqueID of the newly inserted table.
◆ Delete()
 Result< void > ACAPI::MEP::v1::PreferenceTableContainerBase::Delete  |  ( |  const UniqueID &  |  uniqueId | )
Deletes a PreferenceTable from the container.
Parameters
uniqueId | The UniqueID of the table.
Returns
Returns an error if the parameter does not identify a PreferenceTable, otherwise nothing.
◆ Exists()
 bool ACAPI::MEP::v1::PreferenceTableContainerBase::Exists  |  ( |   | ) |   const
Returns
Checks if the object still exists.
◆ GetPreferenceTables()
 std::vector< UniqueID > ACAPI::MEP::v1::PreferenceTableContainerBase::GetPreferenceTables  |  ( |   | ) |   const
Returns
Returns the UniqueIDs of the PreferenceTables associated with the caller object's domain.
◆ Modifier()
 ACAPI::MEP::v1::PreferenceTableContainerBase::Modifier  |  ( |  PreferenceTableContainerBase &  |  parent | )
protected
Constructs a Modifier with the given PreferenceTableContainerBase.
Parameters
parent | The given PreferenceTableContainerBase.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::v1::PreferenceTableContainerBase::Modify  |  ( |  const ModifierFunc &  |  modifierFunc,
|  const GS::UniString &  |  undoString
)
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.